Revit 2027 API
RevitCommandId Methods
The RevitCommandId type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
LookupCommandId |  Looks up and retrieves the Revit command id with the given id string.
LookupPostableCommandId |  Looks up and retrieves the Revit command id with the given id string.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RevitCommandId Class
Autodesk.Revit.UI Namespace